homebrew.org
#+TITLE: Homebrew Loom: DotCortex
#+DESCRIPTION: Homebrew manifest (macOS)
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Homebrew manifest
Columns: NAME KIND TAP PIN ARGS TAGS R1 R2
KIND: formula or cask. On this machine, we will use formula only for now.
#+BEGIN_SRC text :tangle all/.homebrew/manifest/brews.ssv
# ~/DotCortex/all/.homebrew/manifest/brews.ssv
# NAME KIND TAP PIN ARGS TAGS R1 R2

# Test formulas
kitty             cask    "" "" "" "" "" ""
opencode-desktop  cask    "" "" "" "" "" ""
lazygit           formula "" "" "" "" "" ""
#+END_SRC


* Isolated Homebrew env for DotCortex
#+BEGIN_SRC bash :tangle all/.local/bin/dotcortex-brew-env :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/dotcortex-brew-env
set -euo pipefail

BREW_BIN="${BREW_BIN:-}"

# Try to find an existing brew first
if command -v brew >/dev/null 2>&1; then
  BREW_BIN="$(command -v brew)"
elif [ -x "/home/linuxbrew/.linuxbrew/bin/brew" ]; then
  BREW_BIN="/home/linuxbrew/.linuxbrew/bin/brew"
elif [ -x "/opt/homebrew/bin/brew" ]; then
  BREW_BIN="/opt/homebrew/bin/brew"
elif [ -x "/usr/local/bin/brew" ]; then
  BREW_BIN="/usr/local/bin/brew"
fi

if [ -z "${BREW_BIN:-}" ]; then
  echo ">> Homebrew not found, installing Homebrew for this user"
  /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"

  # Try again after install
  if command -v brew >/dev/null 2>&1; then
    BREW_BIN="$(command -v brew)"
  elif [ -x "/home/linuxbrew/.linuxbrew/bin/brew" ]; then
    BREW_BIN="/home/linuxbrew/.linuxbrew/bin/brew"
  elif [ -x "/opt/homebrew/bin/brew" ]; then
    BREW_BIN="/opt/homebrew/bin/brew"
  elif [ -x "/usr/local/bin/brew" ]; then
    BREW_BIN="/usr/local/bin/brew"
  fi
fi

if [ -z "${BREW_BIN:-}" ]; then
  echo "!! Homebrew installation failed or brew still not found" >&2
  exit 1
fi

BREW_PREFIX="$("$BREW_BIN" --prefix 2>/dev/null || true)"

if [ -n "$BREW_PREFIX" ]; then
  export HOMEBREW_PREFIX="${HOMEBREW_PREFIX:-$BREW_PREFIX}"
  export PATH="$HOMEBREW_PREFIX/bin:$HOMEBREW_PREFIX/sbin:$PATH"
else
  # Fallback, but still make sure brew is in PATH
  BREW_DIR="$(dirname "$BREW_BIN")"
  export PATH="$BREW_DIR:$PATH"
fi

exec "$@"
#+END_SRC


* Apply manifest inside DotCortex Homebrew env
#+BEGIN_SRC bash :tangle all/.local/bin/brew-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/brew-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.homebrew/manifest/brews.ssv"
RUN="$HOME/.local/bin/dotcortex-brew-env"
OS="$(uname -s)"

# ENFORCE=1 UNINSTALL=1 means: remove formulas that are not in manifest.
ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"

echo "== brew apply =="

_emit_norm() {
  awk -v FS='[[:space:]]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[[:space:]]*#/ || NF==0 { next }
    {
      n1=$1; n2=$2; n3=$3; n4=$4; n5=$5; n6=$6; n7=$7; n8=$8;
      printf "%s\0%s\0%s\0%s\0%s\0%s\0%s\0%s\0",
        dequote(n1),dequote(n2),dequote(n3),dequote(n4),
        dequote(n5),dequote(n6),dequote(n7),dequote(n8)
    }
  ' "$MAN"
}

# Install or upgrade from manifest
while IFS= read -r -d '' name \
   && IFS= read -r -d '' kind \
   && IFS= read -r -d '' tap \
   && IFS= read -r -d '' pin \
   && IFS= read -r -d '' args_str \
   && IFS= read -r -d '' tags \
   && IFS= read -r -d '' r1 \
   && IFS= read -r -d '' r2
do
  [ -n "$name" ] || continue

  # Normalise kind, default to formula
  kind="${kind:-formula}"

  # Skip macOS casks on non Darwin hosts
  if [ "$kind" = "cask" ] && [ "$OS" != "Darwin" ]; then
    echo ">> skipping macOS cask $name on $OS"
    continue
  fi

  # Ensure tap if requested
  if [ -n "$tap" ]; then
    "$RUN" brew tap "$tap"
  fi

  # Build brew install args
  cmd=(install)

  if [ "$kind" = "cask" ]; then
    cmd+=(--cask)
  fi

  cmd+=("$name")

  if [ -n "$args_str" ]; then
    IFS=',' read -ra AA <<<"$args_str"
    for a in "${AA[@]}"; do
      [ -n "$a" ] && cmd+=("$a")
    done
  fi

  echo ">> brew ${cmd[*]}"
  "$RUN" brew "${cmd[@]}"

  # Optional pin
  if [ -n "$pin" ]; then
    echo ">> brew pin $name"
    "$RUN" brew pin "$name" || true
  fi

done < <(_emit_norm)

# Optional uninstall of extras
if [ "$ENFORCE" = 1 ] && [ "$UNINSTALL" = 1 ]; then
  echo "== uninstall extras =="

  want_tmp="$(mktemp)"
  have_tmp="$(mktemp)"

  # Only track names from manifest for now
  awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" \
    | sort -u >"$want_tmp"

  # Current formulas installed
  "$RUN" brew list --formula 2>/dev/null \
    | sort -u >"$have_tmp"

  # Extras = have - want
  comm -13 "$want_tmp" "$have_tmp" | while read -r extra; do
    [ -n "$extra" ] || continue
    echo ">> brew uninstall $extra"
    "$RUN" brew uninstall "$extra" || true
  done

  rm -f "$want_tmp" "$have_tmp"
fi

echo "Done."
#+END_SRC


* Health
#+BEGIN_SRC bash :tangle all/.local/bin/brew-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/brew-health
set -euo pipefail

"$HOME/.local/bin/dotcortex-brew-env" bash -lc '
echo "HOMEBREW_PREFIX=${HOMEBREW_PREFIX:-$(brew --prefix 2>/dev/null || echo unknown)}"
command -v brew || echo "brew not in PATH"
brew --version
echo
brew config || true
'
#+END_SRC


* Makefile fragment for Homebrew
#+BEGIN_SRC makefile :tangle all/.mk/homebrew.mk :padline no
# ~/DotCortex/all/.mk/homebrew.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: brew-apply brew-health

brew-apply:
| @chmod +x $(HOME)/.local/bin/brew-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=1 UPDATE=1 $(HOME)/.local/bin/brew-apply

brew-health:
| @chmod +x $(HOME)/.local/bin/brew-health 2>/dev/null || true
| $(HOME)/.local/bin/brew-health
#+END_SRC
