all/.local/bin/brew-apply
#!/usr/bin/env bash
# Apply manifest inside DotCortex Homebrew env

# [[file:../../../homebrew.org::*Apply manifest inside DotCortex Homebrew env][Apply manifest inside DotCortex Homebrew env:1]]
# ~/DotCortex/all/.local/bin/brew-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.homebrew/manifest/brews.ssv"
RUN="$HOME/.local/bin/dotcortex-brew-env"
OS="$(uname -s)"

# ENFORCE=1 UNINSTALL=1 means: remove formulas that are not in manifest.
ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"

echo "== brew apply =="

_emit_norm() {
  awk -v FS='[[:space:]]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[[:space:]]*#/ || NF==0 { next }
    {
      n1=$1; n2=$2; n3=$3; n4=$4; n5=$5; n6=$6; n7=$7; n8=$8;
      printf "%s\0%s\0%s\0%s\0%s\0%s\0%s\0%s\0",
        dequote(n1),dequote(n2),dequote(n3),dequote(n4),
        dequote(n5),dequote(n6),dequote(n7),dequote(n8)
    }
  ' "$MAN"
}

# Install or upgrade from manifest
while IFS= read -r -d '' name \
   && IFS= read -r -d '' kind \
   && IFS= read -r -d '' tap \
   && IFS= read -r -d '' pin \
   && IFS= read -r -d '' args_str \
   && IFS= read -r -d '' tags \
   && IFS= read -r -d '' r1 \
   && IFS= read -r -d '' r2
do
  [ -n "$name" ] || continue

  # Normalise kind, default to formula
  kind="${kind:-formula}"

  # Skip macOS casks on non Darwin hosts
  if [ "$kind" = "cask" ] && [ "$OS" != "Darwin" ]; then
    echo ">> skipping macOS cask $name on $OS"
    continue
  fi

  # Ensure tap if requested
  if [ -n "$tap" ]; then
    "$RUN" brew tap "$tap"
  fi

  # Build brew install args
  cmd=(install)

  if [ "$kind" = "cask" ]; then
    cmd+=(--cask)
  fi

  cmd+=("$name")

  if [ -n "$args_str" ]; then
    IFS=',' read -ra AA <<<"$args_str"
    for a in "${AA[@]}"; do
      [ -n "$a" ] && cmd+=("$a")
    done
  fi

  echo ">> brew ${cmd[*]}"
  "$RUN" brew "${cmd[@]}"

  # Optional pin
  if [ -n "$pin" ]; then
    echo ">> brew pin $name"
    "$RUN" brew pin "$name" || true
  fi

done < <(_emit_norm)

# Optional uninstall of extras
if [ "$ENFORCE" = 1 ] && [ "$UNINSTALL" = 1 ]; then
  echo "== uninstall extras =="

  want_tmp="$(mktemp)"
  have_tmp="$(mktemp)"

  # Only track names from manifest for now
  awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" \
    | sort -u >"$want_tmp"

  # Current formulas installed
  "$RUN" brew list --formula 2>/dev/null \
    | sort -u >"$have_tmp"

  # Extras = have - want
  comm -13 "$want_tmp" "$have_tmp" | while read -r extra; do
    [ -n "$extra" ] || continue
    echo ">> brew uninstall $extra"
    "$RUN" brew uninstall "$extra" || true
  done

  rm -f "$want_tmp" "$have_tmp"
fi

echo "Done."
# Apply manifest inside DotCortex Homebrew env:1 ends here
